/**
 * Объект со списком вопросов.
 */
const questions = [
    {
        title   : 'Как называются стандарты програмирования на Java Script?',
        answares: {
            a: 'ES5, ES6',
            b: 'PEP8, PEP9',
            c: '"Красивый код"',
            d: 'Это свободный язык! Пишу как хочу!'
        },
        correct: 'a'
    },
    {
        title   : 'Что не является простым типом данных в Java Script?',
        answares: {
            a: 'Boolean',
            b: 'Все варианты верны',
            c: 'Object',
            d: 'String'
        },
        correct: 'c'
    },
    {
        title   : 'К какому типу относится язык программирования Java Script?',
        answares: {
            a: 'интуитивный',
            b: 'интерпритируемый',
            c: 'компилируемый',
            d: 'магическим'
        },
        correct: 'b'
    },
    {
        title   : 'Как называется механизм преобразования простых типов в сложные "на лету"?',
        answares: {
            a: 'Transformation',
            b: 'Morfing',
            c: 'Boxing',
            d: 'Ты о чем вообще?'
        },
        correct: 'c'
    },
    {
        title   : 'Сколько свойств и методов может быть у объектов в Java Script?',
        answares: {
            a: 'максимум 20',
            b: 'до 50',
            c: '4',
            d: 'нет ограничений'
        },
        correct: 'd'
    }
];
