/* Чему будут равны переменные x и a в примере ниже? Написать почему так произошло 
(описать последовательность действий) */

let a = 2;
let x = 1 + (a *= 2);

/* В коде приведен пример инициализации двух переменных с присвоением начальных значений.
В первой строке переменной "a" присваивается значение 2. Во второй сначала выполняется действие в скобках:
значение переменной "a" умножается на 2 и ей же присваивается результат (=4). Далее переменной x присваивается
сумма 1 и значение переменной "a". */
